import json
import random

from openai_access import call_chatgpt
# from depth import createConstraintsPrompt, createDeepenPrompt, createConcretizingPrompt, createReasoningPrompt
from depth import createDataPrompt , createExamplePrompt
from trans import transtyle , transtructure
from breadth import createBreadthPrompt
import os
from concurrent.futures import ThreadPoolExecutor, as_completed


def getevolprompt(instruction, type):
    """
    输入instruction 以及增广类型
    返回变换之后的文字
    
    """
    if type=='example' :
        return createExamplePrompt(instruction)
    elif type == 'data':
        return createDataPrompt(instruction)
    elif type == 'style':
        return transtyle(instruction)
    elif type == 'structure' :
        return transtructure(instruction)
    elif type == 'bread' :
        return createBreadthPrompt(instruction)
    else:
        print('use con,deep,concret,reason,bread plz')



one_1_t = []
one_1_t.append(
   'A总19年5月到粤海大区，三年的时间，一周两次接触，基本天天沟通。\
整体印象：优势：为人正直，不差公司钱，为人认真，粤海大区欠了总部3000多万，还了总部，业务完成。\
注重预算管理，年度规划，季度做计划，管理很严格，对总部政策研究比较透，掌握的了很多资源。\
善于学习：珠江课堂，推动全员学习，做第一任院长，自己把院长接过来，定期开展直管团队的学习。建立21个分院，对总部政策，策略执行落地的文化宣贯。\
前瞻决断：在云广贵佐大区总，建了一个工厂，基于消费情况和潜力，当地奶源保障提供了很好的助力，粤海地区，像广州深圳，在大湾区做创新中心，建立了一个工作站，了解当地消费者需求，购物习惯，预见到未来。通过各种场合，不管的大小会议，主动申请在粤海开会，不同季节邀请领导走访市场。2010年做了大区总，做了12年，全国最年轻的大区总，非内蒙出来的大区总，这几年事业部优秀经理人。三年超百达成，实现双位数增长。\
引领团队：对集团的业绩和目标，持续更新，人是第一策略更新到了第15版，人与事，人与组织关系，如何提升自己，服务客户，粤海地区的市场情况，发展前景。六本计划，户口本、车辆、大学本科、结婚证、护照，推动大家走出去，学起来。不是很强势的领导，希望协同共赢。重大策略他来提议，大家共创共识。\
待发展：1、加强与总部沟通，粤海地区与其他地方不一样，竞品销量是我们的1.5倍。粤海分子公司多，分子公司与重客垂直的成本高，给到经销商团队的资源很少。2、对内部，做实RBU的布局，组织架构图，经营模式。9个RBU合并成6个，对特别大的省区增加市场督导，做市场检查和经营分析，促进工作开展落地。3、本土人才储备：一季度结束后，北方同事想回北方发展，需要培养本土的经理人才。'
)
one_1_t.append('12年底到现在10年的时间。云贵区域行销，负责销售策略汇报和预算管理汇报。到去管理重客，与零售商联合活动汇报。运营策略，方案设计，预算管控与追踪，市场协同走访。\
认真负责，有行动力，身体力行。对下属包容和对团队的关爱。对团队理性和有克制。\
对公司长远发展和交代的事情，对公司的战略很认真的对待，记下来，研究和领域，学习钻研。对团队和领导负责人，对目标坚定和执着，担当不推诿。帮助团队成长，业绩导向，经营利润改善。有行动力想好了就干，走访市场参与一线。第一是快第二是实干。\
待发展：工作以外没有什么兴趣和专长，就是在工作本身研究的过多。限制了工作的进一步往上提升。多读书，继续深造等。')

one_1_t.append('2010年认识A总，在冰品，在云贵广做他的下属。13年回到粤海，19年5粤来到粤海，进行共事。将近3年时间。主要工作日常管理，跟踪工作的对接和交流。电话和钉钉比较多，他是非常细致的领导，日常汇报，组织了一个销售支持部门群。每天进行汇报和沟通，重要事情就是电话。\
比较年轻，27岁做大区总。对细节把控，对于人才培养和交流。日常工作笔记本，从入职上班，有几十本的工作笔记，认真的交流记录。对于公司思路和发展，产品政策有独到见解。学习能力和意志，认真思考。重点回顾的习惯。对工作认真负责，细心，工作闭环的管理，工作跟进监督。强有力的行动力。举例：1 去客户那，客户有500-600件的旧货，我当时没在他自己去的，他打电话跟我共享，跟客户做了沟通，需要你推动，做了哪些，做没做，做到什么程度。详细追踪的过程和结果。2 不断追踪这个事情的结果，不断过问。客户出现问题，提供解决，给予结果。客户发生窜货，客户拉到什么程度，仓库视频和照片，视频，追踪到结果。\
待提升点：过于细节把控，并不能适应这种习惯，有些可以放手。太细的话，很多不在自在。他是老师出身，对学生的教学理念。')

one_1_t.append('3年的时间了，一直是向他直接汇报。认真负责人、有执行力、有大局观，为组织负责不顾个人私利。为团队成长非常关注，帮团队改变。')


four_1_1_t = []
four_1_1_t.append('穷则思变，研究产品全链条，粤海与北方差距很大，人多钱多，店小，单包消费多。不同情况下，做一些思考。')
four_1_1_t.append('主要是调查研究，终端门店走访，有个大概的信息，通过店主访谈，找一些行业的最佳实践，去华为、美的，最近抖音直播卖货企业做交流和沟通。看一些别的品牌和操作方法。找到相关的制度和规范，电商社区平台，相关公司管理制度做参考，叫上内部销售做访谈，输出建议方案，给与反馈。\
五年百亿粤海目标，对常温当前来讲，现有模式和预期达成的目标不是很匹配，销售组织有进步的空间，分子公司比较多，占比60%的销量，垂直16%。这些业绩没有利润。需要转变销售管理模式。\
按照现有体质设计百亿，经销商业务增加，市场布局业务的提升，第一阶段解决布局的问题，从分子公司到经销商的布局。建立标杆城市，区域策略，最后超越竞争对手。')
four_1_1_t.append('A总通过市场走访，交流，发现问题达到共识。来自市场的建议，听经销商的想法和心声。这两个月走访市场，上个月底6天走了十几个市场。\
记录每个市场的问题点，市场库存和终端，非常细致。亲自于店主业务员沟通。')

four_1_2_t = []
four_1_2_t.append('2月分46个市场，把费用授权到省经理，进行规划，我们来指导，人财物给到一线。做产品的代言人，做了调研，做宣传。总部创新的模式，去到哪里宣传到哪里，形成共享。文化、产品、经营模式的代言人。')
four_1_2_t.append('基于什么原因，怎么发生的，需要哪些部门去解决。与渠道沟通，运营去沟通。惠东市场，客户比较配合，两个月联合销售有压力，单点核算，客户反馈电商价格低，与渠道部经理沟通，汇报完与渠道做一个解决交流。客户当月把任务量百分百完成了。')
four_1_2_t.append('他会经常跟我们走市场，会去观察消费者的行为，会观察所有的产品，不管是大区经营还是不经营的会放在办公室里观察，也会一直思考如何能符合消费者的习惯。比如他洞察到过节时，要关注用户的手提袋的使用，没到过节期间会备手提袋，提升销售。\
2年前，广东市场，当地有一个发酵的酸奶，他比我们的酸酸乳口感要好营养要好，但零售价比我们贵，渠道和消费者很认可，他就给研发中心提出来，要做一款符合当地消费者的酸奶。目前正在研发中。')



four_2_1_t = []
four_2_1_t.append('写出一系列安全保障，成立安全委员会，保障整体员工安全，做好物流保障。在疫情最紧张的时候，开了一个月的早课，让大家起床分享案例，各地成功经验做分享。发起红海行动，慰问。')
four_2_1_t.append('比较讲究团队共创，信息共享，什么信息都与大家共享，确保大家对事情的认知。把关键项目和指标做共享，围绕公司和大区目标共创解决方案。有岗位，有职责和阶段性分工。')
four_2_1_t.append('20多人汇报，9个分子公司，8个RBU,几个职能经理，KA，行销，渠道，质量管理。以目标为导向，部门分工明确。')
four_2_1_t.append('经常会给我们一些书，给我们提供学习的环境，有一个珠江学院，他自己 会给我们将，我们也会讲课给自己的团队。一个月会给我们开次会，会讲一下统一团队的思想。')


four_2_2_t = []
four_2_2_t.append('提升人员能力，学习项目提升，对优秀员工定期进行表彰，对客户也会做表彰。份额第一，增速第一，基本都做到了。特仑苏销量、增长率、份额全国第一，市场秩序第一。对于激励这块，针对不同项目分解到不同的部门进行激励，今年调整完，一线员工的激励总价。买好酒给我们，花了十几二十万，请我们去广州最好的米其林餐厅吃饭。')
four_2_2_t.append('团队氛围简单，高效，信息透明。（激励，战斗力没有提）')
four_2_2_t.append('团队氛围压力很大，客户氛围有非常大压力，客户稳定性上。做好每件事。对做好的点会表扬。也没有什么方法去处理和解决。消费习惯改变不是我能解决的问题。电商社区团购已经对消费者造成了习惯。目前也不指导该怎么做。经销商感触很大，不盈利，赢利点很难受。各个渠道都抢夺。')
four_2_2_t.append('他会面谈，思想上做工作。最近团队士气不佳，流动比较大，压力比较大。他在思想上做的好了，但在物质上要关注员工到底有什么困难，才能留人。也没有吸引太好的人才。')

four_2_3_t = []
four_2_3_t.append('最优秀的代表是朱涛，给予授权。运营规划让他来统筹，整个对他挑战比较大。争取很多学习机会。比如蓝海项目，总部很多会议机会，定期大型企业走访交流。')
four_2_3_t.append('CBU经理，钟日超，清远省经理，肖善洋。人才盘点参与程度高，各个部门盘点关注，发现这些人，过程中每个省区关键岗位做一些针对性的协同走访去观察人的表现，给些福利项目测试，给大家更多历练的机会。')
four_2_3_t.append('会给一些课程，方法，工具，怎么去做和客户沟通交流，会上说一些问题，亲自带我们和客户沟通交流。')



# four_3_1_t = []
# four_3_1_t.append('对自我的时间管理很好，每天早上读书听书，每周运动健身很规律，每周爬山。')


four_3_2_t = []
four_3_2_t.append('大湾区交通发达，我们是受到外部冲击最大，粤海网络发达，平台价格很乱，在2019年年底成立市场秩序管控小组，进行市场机制的管理，出台内部制度。市场秩序与质量管理升级他自己直接管理。')
four_3_2_t.append('粤海过去销售逻辑给一个点数，做什么多给点数，经销商满意度非常好，疫情以后，总部也加强了总部管理，对预算科目要求越来越多，和专项指标要求，大区压力比较大，带领大家做预算管理办法。\
都是在常温体系，从一线业务做冰品，做常温大区总，挑战点：需要做创新业务模式和品类上做更多研究和关注')
four_3_2_t.append('他来了这三年，是全国最难的三年，大家学习氛围加强了，对与销售增长压力很大。大家情绪不高，暴露出来问题。')

four_4_1_t = []
four_4_1_t.append('深圳2018年10月从经销商转成子公司，任务量11亿，经销商巨亏几千万，市场体量大。A总定期走访交流，大型项目变革做法，第一时间与广深做沟通。带动下深圳从60万做到100万单月，广深的结构占比从30多，到60多。通过调整产品结构，推广新品，盘活分子公司，形成盈利。')
four_4_1_t.append('激励大家：不断给大家加油鼓劲，不断鼓励大家好的做法，指导思想和建议。多下来看看，关心和鼓励我们。')
four_4_1_t.append('对目标的执着，刚刚发生的，上个月压力比较大，带领团队开会到凌晨，不管多困难也会对组织负责人。')

four_4_2_t = []
four_4_2_t.append('有一年发生遵义学生饮奶事件，组织相关人员和总部相关人事，好几天在那里帮助大家梳理事情，妥善解决了饮奶事件。短时间快速应对，与公司协同。')

four_5_1_t = []
four_5_1_t.append('A总争取一切资源到大区开，试点项目在粤海驱动。在大区层面，与闽赣，3月去昆明分子公司走访学习。与清远工厂一个月一定会去一次，组织变革，大型活动也会邀请他们参加。')
four_5_1_t.append('与闽赣大区定期做交流，带着客户一起去昆明学习。')
four_5_1_t.append('去外部进行交流，去了美的交流。')
four_5_1_t.append('这方面非常好，云南的工场是A总协同推动的建厂。')

four_5_2_t = []
four_5_2_t.append('A总注重与总部的沟通，休假时候回内蒙，走访生产基地。借调的主管，是总部做过的。内部效率有很多分析数据确保产品调拨。')
four_5_2_t.append('高管们来到粤海做对口的交流，适合粤海地区的产品。')

six_1_t = []
six_1_t.append('自己践行，是企业文化的代言人。开班集训第一堂课是他来讲，珠江学员，一个季度讲一次企业文化。随时可以找出什么笔记本记了什么事情。把03年的笔记本找出来。\
    异想才能天开：成立工厂，及创新工作战，非常有高度。')
six_1_t.append('蒙牛精神绝对体现，对消费者第一第一非常强调，站在消费者角度去研究销售的链条。\
提升：异想天开需要加强，')
six_1_t.append('做正确的事，各种公司正确的价值观。让大家做分享。很正直的人，强调价值观的灌输，先做人后做事。')
six_1_t.append('正直立本——他管的特通的价格和常规价格不一样，如果只顾自己大区的利益的话，比如特通进过来是35，常规是41，对于他来说就是不占公司的政策的便宜。对国家层面也要多交税，多做贡献，不偷税不漏税。')


seven_4_t = []
seven_4_t.append('知识面体系话，放在销管中心负责人，适合创新业务。')
seven_4_t.append('全面的负责，供销一体化的全面负责，实体经营的部分。全国层面品列独立的负责。\
对新入职的大区经理差异比较多，人还是在不断变化中，过程只是考评业绩结果。未来就没有年轻人愿意加入销售团队。')
seven_4_t.append('适合做个成熟业务的销售总监，从基层做起来。')
seven_4_t.append('人才方面要关注，别的没有了。')



num = 100

text_list = [one_1_t , four_1_1_t , four_2_1_t,four_2_2_t,four_2_3_t, four_3_2_t,four_4_1_t,four_4_2_t,four_5_1_t,four_5_2_t,six_1_t,seven_4_t]
name_list = ['one_1_t' , 'four_1_1_t' , 'four_2_1_t','four_2_2_t','four_2_3_t','four_3_2_t','four_4_1_t','four_4_2_t','four_5_1_t','four_5_2_t','six_1_t','seven_4_t']



def augment(types, num, instruction, index1):
    """
    输入增广选择types 增广数量 num=1  要增广的 instruction
    返回一个augment 的结果 是一个{}
    """
    type = random.choice(types)
    selected_evol_prompt = getevolprompt(instruction , type)
    evol_instruction = call_chatgpt(selected_evol_prompt)
    return {"type":type,"evol_prompt":evol_instruction, 'index':index1}


def process_task(index, text):
    results = []
    for x in range(num):  # 假设 num 是要重复的次数
        print(x)
        text1 = random.choice(text)
        index1 = text.index(text1)
        # print('start here')
        # print(text1)
        aug = augment(types=['style', 'structure', 'bread'], num=1, instruction=text1, index1=index1)
        results.append(aug)
    file_path = f'result_1_x/{name_list[index]}.json'
    # print(file_path)
    with open(file_path, 'w', encoding='utf-8') as f:
        json.dump(results, f, ensure_ascii=False, indent=4)
    
    
with ThreadPoolExecutor() as executor:
    futures = {executor.submit(process_task, index, text): index for index, text in enumerate(text_list)}

# 等待所有线程完成
for future in futures:
    try:
        future.result()
    except Exception as exc:
        print(f'Generated an exception: {exc}')